---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.ExternalResourceServerUtils
source: html/ffe9d47e-61af-5e21-bf47-c2b5ecb119cd.htm
---
# ExternalResourceServerUtils Members

Checks whether the name is a valid short name for the external resource server.